<?php
defined('BASEPATH') OR exit('No direct script access allowed');

class Migration extends MY_Controller {

	function __construct()
	{
		parent::__construct();
		// $this->load->library('migration');
	}

	public function index()
	{
		if ($this->migration->version(0) === FALSE)
			show_error($this->migration->error_string());

		if ($this->migration->latest() === FALSE)
      show_error($this->migration->error_string());

		$this->db->insert('member',array(
			'id' => '1',
			'fullname' => 'admin',
			'email' => 'admin@email.com',
			'password' => 'password',
			'date_create' => date('d/m/Y')
			)
		);

		$this->db->insert_batch('nature',array(
			array(
				'id' => '1',
				'name' => 'เป็นมิตร',
				'detail' => 'ปลานิสัยดีรักสงบ ปลากลุ่มนี้ชอบอยู่รวมกันเป็นฝูง รักสงบไม่ทำร้ายกันเอง ไม่ชอบอยู่ตัวคนเดียวโดดๆเพราะกลัวเหงา(ฮี่ๆ)หากอยู่ตัวเดียวจะชิงเหงาตายจึงควรเลี้ยงเป็นฝูงเพื่อไม่ให้เหงาจนตาย สำหรับปลากลุ่มนี้หากจะเลี้ยงรวมกับปลาชนิดอื่นควรหาปลาที่มีขนาดเท่าๆกัน'
			),
			array(
				'id' => '2',
				'name' => 'นักสู้',
				'detail' => 'ปลานิสัยหวงถิ่น เป็นปลากลุ่มประเภทที่ถิ่นข้าใครอย่าแหยม เป็นปลาที่ชอบปักหลักเป็นที่เป็นทาง มักมีอณาเขตเป็นของตัวเอง ปลากล่มนี้ไม่ชอบอยู่ร่วมกับปลาชนิดอื่น นิสัยโดยส่วนตัวไม่ดุร้ายนะแต่หากใครข้ามถิ่นเข้ามาก็มีเรื่อง'
			),
			array(
				'id' => '3',
				'name' => 'ก้าวร้าว',
				'detail' => 'ปลานิสัยก้าวร้าว ปลาพวกนี้ชอบอยู่รวมกันเป็นฝูงแล้วไปยกพวกตีกับคนอื่นโฮ่ๆๆ ... (ปลาช่วงกลหรือไงฟะ) แต่พอวันไหนว่างๆไม่รู้จะไปหาเรื่องกับใครก็จะหันมาอัดกันเองคลายเครียด ดังนั้นปลากลุ่มนี้หากจะเลี้ยงรวมกับปลาอื่นควรจะหากปลาที่ตัวใหญ่กว่ามาเลี้ยง'
			),
			array(
				'id' => '4',
				'name' => 'ดุร้าย',
				'detail' => 'ปลานิสัยดุร้าย พวกปลากลุ่มนี้เป็นนักเลงตัวจริงครับ และมักจะเป็นปลากินเนื้อ ไม่ชอบอยู่ร่วมกับใครหน้าไหน ชอบเป็นพระเอกฉายเดี่ยววันแมนโชว์ ปลาพวกนี้นอกจะหาเรื่องอัดชาวบ้านแล้วแม้นแต่พวกเดียวกันมันก็ไม่เว้น ดังนั้นปลาพวกนี้จึงมักเป็นนักโทษขังเดี่ยวเลี้ยงตัวเดียว แต่หากจะเลี้ยงรวมกับปลาชนิดอื่น ที่มีความสามารถหลบหลีกว่องไว และตู้ที่เลี้ยงควรมีขนาดที่ใหญ่เพื่อมีพื้นที่ในการหลบหนี อีกทั้งการให้อาหารก็ควรให้อย่างพอเพียงเพื่อป้องกันการแย่งอาหารกัน'
			))
		);

		$this->db->insert_batch('feed',array(
			array(
				'id' => '1',
				'name' => 'กินพืช',
				'detail' => 'กินพืชประเภท.... กินเป็นจำนวนมาก... เน้นกินเฉพาะ....และ...'
			),
			array(
				'id' => '2',
				'name' => 'กินพืชและสัตว์น้ำที่มีขนาดเล็กกว่า',
				'detail' => 'กินพืชเป็นส่วนใหญ่... แต่ถ้าพบเห็นสัตว์น้ำที่มีขนาดเล็กก็จะกินด้วยเช่นกัน'
			),
			array(
				'id' => '3',
				'name' => 'กินสัตว์น้ำที่มีขนาดเล็กกว่า',
				'detail' => 'กินอย่างเอร็ดอร่อย ตะกละมูมมาม กินเป็นจำนวนมาก และกินพวกเดียวกันเองด้วย'
			),
			array(
				'id' => '4',
				'name' => 'กินสัตว์น้ำโดยไม่สนใจขนาด',
				'detail' => 'กินสัตว์น้ำเป็นอาหาร โดยไม่สนใจขนาด และกินพวกเดียวกันเองด้วย'
			))
		);

		$this->db->insert_batch('living',array(
			array(
				'id' => '1',
				'name' => 'รักสันโดษ',
				'detail' => 'ไม่สามารถเข้ากลุ่มใดๆ ได้'
			),
			array(
				'id' => '2',
				'name' => 'รักสันโดษ/อยู่เป็นคู่',
				'detail' => 'รักสันโดษ แต่ถ้ามีคู่จะอยู่เป็นคู่ ไม่ห่างไปไหน'
			),
			array(
				'id' => '3',
				'name' => 'รักสันโดษ/อยู่เป็นคู่/อยู่เป็นกลุ่ม',
				'detail' => 'สามารถอยู่ตัวเดียวได้ สามารถอยู่เป็นคู่ได้ แต่ถ้ามีหลายตัวจะเกาะกลุ่มด้วยกัน'
			),
			array(
				'id' => '4',
				'name' => 'อยู่เป็นกลุ่ม',
				'detail' => 'นิยมการอยู่เกาะกลุ่มไม่แยกตัว'
			))
		);

		$this->db->insert_batch('container',array(
			array(
				'id' => '1',
				'name' => 'ตู้กระจก'
			),
			array(
				'id' => '2',
				'name' => 'ตู้กระจกพื้นทรายหรือบ่อทราย'
			),
			array(
				'id' => '3',
				'name' => 'ตู้กระจกพื้นโคลนหรือบ่อโคลน'
			),
			array(
				'id' => '4',
				'name' => 'บ่อคอนกรีต'
			))
		);

		redirect('main');
	}

}
